laurigates/mcu-tinkering-lab/packages/esp32-projects/nfc-scavenger-hunt/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# mDNS hostname discovery (nfc-scavenger-hunt.local)
CONFIG_MDNS_ENABLED=y

# Main task stack — needs headroom for WiFi + TLS + HTTPS init
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM support (critical for audio buffering)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Allow malloc from PSRAM when internal RAM is exhausted
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# WiFi (canonical block — see .claude/skills/wifi-sta-setup/SKILL.md)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_AMSDU_TX_ENABLED=n
CONFIG_ESP_WIFI_NVS_ENABLED=y

# TLS — full certificate bundle for Google API HTTPS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Larger HTTP buffer for Gemini JSON responses
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog — generous timeout for TLS handshake
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# NVS encryption not needed for home toy
CONFIG_NVS_ENCRYPTION=n

# Partition table — default single factory app
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Flash size (match board: 4MB SuperMini, 8MB XIAO)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
